#數字運算
# 加法
#x = 3+6
#print(x)
# 乘法
#y = 3*6
#print(y)
# 除法
#z = 3/6
#print(z)
# 整數除法
#a = 7//6
#print(a)
# 次方("次方 => 1,2,3,.....","開根號 => 0.5 , .......")
#b = 2**0.5
#print(b)
# 取餘數
#c = 7%33
#print(c)
#########分隔#########
#字串運算
# "字串"
#d = "幹 eoipjgoi rpgujjtkrdv"
#print(d)
# "字串_1"+"字串_2" => 字串連在一起/串接
# "字串_1" "字串_2" => 字串連在一起/串接
#e = "Hello"+"world"
#e = "Hello" "world"
#print(e)
# "......\n......" => \n 換行
# (......=>字串)
# """......
#  ......""" => 換行
#f = "衝\n啥小"
'''
f = """衝
      啥小"""
print(f)
'''
# 重複
#g = " WTF "*3
#print(g)
# 字串會對內部的字元編號(索引)，從0開始算起[0,1,2.....]
# [包括:不包括] => 指定範圍，也可以[0,1,2.....:]或者[:1,2,3.....]
#h = "Hello"
#print(h[0])
#print(h[0:3])
#print(h[:3])
#print(h[2:])